Repository: sebmillet/prpn
Catalog: po/*.po
Languages: fr

source: Try `
fr: Essayez `

source: --help' for more information.
fr: --help' pour plus d'information.

source: Usage:
fr: Utilisation :

source: Print this usage and exit
fr: Affiche cet écran et termine

source: Print version information and exit
fr: Affiche la version et termine

source: Run in text mode
fr: Exécution en mode texte

source: Width of the display, in characters (default: 23)
fr: Largeur de l'affichage, en nombre de caractères (23 par défaut)

source: Height of the display, in lines (default: 5)
fr: Hauteur de l'affichage, en nombre de lignes (5 par défaut)

source: Minimum height of the stack display, in lines
fr: Hauteur minimale de la pile, en nombre de lignes

source: Only in text mode
fr: Uniquement en mode texte

source: Batch mode = display the stack once before exiting
fr: Mode batch = affiche la pile une fois avant de terminer

source: Ignore rc files
fr: Ignore les fichiers de démarrage (fichiers 'rc')

source: Display class count before exiting
fr: Affiche le comptage des classes avant de terminer

source: <debug options> Turn debugging on
fr: <options de debug> Active le déboggage

source: invalid option -- %s
fr: option incorrecte -- %s

source: unrecognized option `%s'
fr: option non reconnue `%s'

source: option requires an argument -- %s
fr: l'option nécessite un argument -- %s

source: option `%s' is ambiguous
fr: l'option `%s' est ambiguë

source: trailing arguments%s
fr: arguments excédentaires%s

source: Allow LAST function
fr: Autorise la fonction LAST

source: Automatic print mode
fr: Mode impression automatique

source: Automatic CR
fr: Retour chariot automatique

source: Principal value (definition range)
fr: Valeur principale (intervalle de définition)

source: Symbolic constants evaluation
fr: Évaluation des constantes symboliques

source: Symbolic functions evaluation
fr: Évaluation des fonctions symboliques

source: Binary integers word size
fr: Taille d'entier binaire

source: Numeric base for binary integers
fr: Base numérique pour les entiers binaires

source: Level 1 display
fr: Affichage du premier niveau

source: Reserved
fr: Réservé

source: Decimal separator
fr: Séparateur décimal

source: Real numbers format
fr: Format des nombres réels

source: Tone
fr: Tonalité

source: Fast printing
fr: Impression rapide

source: Number of decimals
fr: Nombre de décimales

source: Underflow processed normally
fr: Underflow (dépassement vers zéro) traité normalement

source: Overflow processed normally
fr: Overflow (dépassement à l'infini) traité normalement

source: Infinite Result processed normally
fr: Infinite Result (Résultat Infini) traité normalement

source: Angle, unset for degrees, set for radians
fr: Mesure angulaire, degré si désarmé, radian si armé

source: Underflow- processed as an exception
fr: Underflow- (dépassement négatif vers zéro) traité en exception

source: Underdlow+ processed as an exception
fr: Underflow+ (dépassement positif vers zéro) traité en exception

source: Overflow processed as an exception
fr: Overflow (dépassement à l'infini) traité en exception

source: Infinite Result processed as an exception
fr: Infinite Result (résultat infini) traité en exception

source: &File
fr: &Fichier

source: &Edit
fr: &Édition

source: &Flags list
fr: &Liste des indicateurs binaires

source: &Quit
fr: &Quitter

source: &Commands
fr: &Commandes

source: &Help
fr: &Aide

source: &Manual page
fr: &Page de manuel

source: &About
fr: À propos

source: Help
fr: Aide

source: Display a help screen
fr: Affiche un écran d'aide

source: Display the list of flags
fr: Affiche la liste des indicateurs binaires

source: Quit program
fr: Quitte le programme

source: Display information about this program
fr: Informations sur ce programme

source: Subtraction: x - y
fr: Soustraction : x - y

source: Power: x ^ y
fr: Puissance : x ^ y

source: Percentage: (x * y) / 100
fr: Pourcentage : (x * y) / 100

source: Percentage change: 100 * (y - x) / x
fr: Pourcentage de changement : 100 * (y - x) / x

source: Percentage of total: 100 * y / x
fr: Pourcentage du total : 100 * y / x

source: Modulus: x - y * FLOOR(x / y)
fr: Modulo : x - y * FLOOR(x / y)

source: Minimum of two reals
fr: Minimum de deux réels

source: Maximum of two reals
fr: Maximum de deux réels

source: Cosine
fr: Cosinus

source: Sine
fr: Sinus

source: Tangent
fr: Tangente

source: Arccos
fr: Arc-cosinus

source: Arcsin
fr: Arc-sinus

source: Arctan
fr: Arc-tangente

source: Logarihtm (e base)
fr: Logarithme (base e)

source: Exponential
fr: Exponentiel

source: Logarithm (10 base)
fr: Logarithme (base 10)

source: 10 base exponential (10^x)
fr: Exponentiel en base 10 (10^x)

source: Hyperbolic cosine
fr: Cosinus hyperbolique

source: Hyperbolic sine
fr: Sinus hyperbolique

source: Hyperbolic tangent
fr: Tangente hyperbolique

source: Arc-hyperbolic cosine
fr: Arc-cosinus hyperbolique

source: Arc-hyperbolic sine
fr: Arc-sinus hyperbolique

source: Arc-hyperbolic tangent
fr: Arc-tangente hyperbolique

source: Opposite
fr: Opposé

source: Integer part
fr: Partie entière

source: Fractional part
fr: Partie décimale

source: Greatest integer lower than or equal to x
fr: Plus grand entier inférieur ou égal à x

source: Lowest integer greater than or equal to x
fr: Plus petit entier supérieur ou égal à x

source: Absolute of x
fr: Valeur absolue de x

source: Sign of x: can be -1, 0 or 1
fr: Signe de x : peut être -1, 0 ou 1

source: Mantisse of x
fr: Mantisse de x

source: Exponent of x
fr: Exponentielle de x

source: Square
fr: Carré

source: Square root
fr: Racine carrée

source: Initializes random values series, 0 to start from a timer value
fr: Initialise la suite des valeurs aléatoires, 0 pour utiliser l'horloge

source: Get a random value x, 0 <= x < 1
fr: Produis une valeur aléatoire x, 0 <= x < 1

source: Smallest real greater than zero the calcultor can represent
fr: Plus petit réel supérieur à zéro représentable par la calculatrice

source: Biggest real the calcultor can represent
fr: Plus grand réel représentable par la calculatrice

source: Convert a decimal to HMS (h.MMSSss)
fr: Convertis un décimal en nombre HMS (h.MMSSss)

source: Convert a HMS (h.MMSSss) to a decimal
fr: Convertis un nombre HMS (h.MMSSss) en décimal

source: Add two HMS (h.MMSSss)
fr: Additionne deux nombres HMS (h.MMSSss)

source: Subtract two HMS (h.MMSSss)
fr: Soustrais deux nombres HMS (h.MMSSss)

source: Convert from degrees to radians
fr: Convertis des degrés en radians (*PI/180)

source: Convert from radians to degrees
fr: Convertis des radians en degrés (*180/PI)

source: Set angular mode to radians
fr: Utilise le radian pour les mesures angulaires

source: Set angular mode to degrees
fr: Utilise le degré pour les mesures angulaires

source: Display first item on multilpe lines
fr: Affiche le premier élément sur plusieurs lignes

source: Display first item on a single line
fr: Affiche le premier élément sur une seule ligne

source: Set the decimal separator to '.'
fr: Utilise la caractère '.' comme séparateur décimal

source: Set the decimal separator to ','
fr: Utilise la caractère ',' comme séparateur décimal

source: Real to complex
fr: Réel à complexe

source: Complex to real
fr: Complexe à réel

source: Get real part of a complex number or array
fr: Partie réelle d'un nombre complexe ou d'un tableau

source: Get imaginary part of a complex number or array
fr: Partie imaginaire d'un nombre complexe ou d'un tableau

source: Get conjugate of a complex number or array
fr: Conjugué d'un nombre complexe ou d'un tableau

source: Get argument of a complex number
fr: Argument d'un nombre complexe

source: Rectangular to polar coordinates
fr: Conversion des coordonnées d'un nombre complexe de rectangulaire à polaire

source: Polar to rectangular coordinates
fr: Conversion des coordonnées d'un nombre complexe de polaire à rectangulaire

source: Is identical
fr: Est identique

source: Equal to
fr: Est égal à

source: Different from
fr: Est différent de

source: Lower than
fr: Est plus petit que

source: Lower than or equal to
fr: Est plus petit que, ou égal à

source: Greater than
fr: Est plus grand que

source: Greater than or equal to
fr: Est plus grand que, ou égal à

source: Logical and
fr: Et logique

source: Logical or
fr: Ou logique

source: Logical xor
fr: Xor logique (exclusion)

source: Logical not
fr: Non logique

source: Copy the first item
fr: Copie le premier élément

source: Exchange the first two items
fr: Échange les deux premiers éléments

source: Delete the first item
fr: Supprime le premier élément

source: Clear the stack
fr: Efface la pile

source: Copy the second item
fr: Copie le second élément

source: Copy the first two items
fr: Copie les deux premiers éléments

source: Delete the first two items
fr: Supprime les deux premiers éléments

source: Move the third item to the first position
fr: Déplace le troisième élément en première position

source: Move the first item to the Nth position
fr: Déplace le premier élément en Nième position

source: Move the Nth item to the first position
fr: Déplace le Ne élément en première position

source: Copy the Nth item
fr: Copie le Ne élément

source: Copy the n first items
fr: Copie les N premiers éléments

source: Delete the n first items
fr: Supprime les N premiers éléments

source: Get the number of items
fr: Renvoie le nombre d'éléments dans la pile

source: Set flag
fr: Active l'indicateur binaire

source: Clear flag
fr: Désactive l'indicateur binaire

source: Return 1 if flag is set, 0 otherwise
fr: Renvoie 1 si l'indicateur binaire est activé, 0 sinon

source: Return 0 if flag is set, 1 otherwise
fr: Renvoie 0 si l'indicateur binaire est activé, 1 sinon

source: Do FS? then clear flag
fr: Exécute FS? et désactive l'indicateur binaire

source: Do FC? then clear flag
fr: Exécute FC? et désactive l'indicateur binaire

source: Convert to string
fr: Convertis un élément en chaîne de caractères

source: Convert from string
fr: Convertis une chaîne de caractère en éléments

source: Extract content from a string or a list
fr: Extrais le contenu d'une chaîne de caractères ou d'une liste

source: Items to list
fr: Mets les éléments dans une liste

source: Extract items from list
fr: Convertis la liste en ses éléments

source: Get an item from a list or array
fr: Extrais un élément d'une liste ou d'un tableau

source: Get an item from a list or array by increments
fr: Extrais un élément d'une liste ou d'un tableau par incréments

source: Put an item into a list or array
fr: Remplace un élément dans une liste ou un tableau

source: Put an item into a list or array by increments
fr: Remplace un élément dans une liste ou un tableau par incréments

source: Dimension of a list or array
fr: Dimension d'une liste ou d'un tableau

source: Replace an array by all its elements
fr: Remplace un tableau par ses éléments

source: Create an array from a list of elements
fr: Crée un tableau avec les éléments de la pile

source: Create a constant array
fr: Crée un tableau constant

source: Transpose a matrix-type array
fr: Transpose une matrice

source: Modify the dimension of an array
fr: Modifie les dimensions d'un tableau

source: Create an identity matrix
fr: Crée une matrice identité

source: Cross product (vectorial product)
fr: Produit vectoriel

source: Dot product (scalar product)
fr: Produit scalaire

source: Evaluate item
fr: Évalue l'élément

source: Store value in variable name
fr: Enregistre la valeur dans la variable

source: Recall value from variable name
fr: Récupère la valeur de la variable

source: Remove a variable
fr: Supprime la variable

source: Get the list of variables in current directory
fr: Renvoie la liste des variables dans le répertoire courant

source: Get the list from root to current directory
fr: Renvoie le répertoire en cours sous forme de liste

source: Create a directory
fr: Crée un répertoire

source: Set root directory as the current one
fr: Définis le répertoire racine comme répertoire courant

source: Make the parent directory the current one
fr: Définis le répertoire parent comme répertoire courant

source: Use binary mode for binary integers
fr: Utilise le mode binaire pour les entiers binaires

source: Use octal mode for binary integers
fr: Utilise le mode octal pour les entiers binaires

source: Use decimal mode for binary integers
fr: Utilise le mode décimal pour les entiers binaires

source: Use hexadecimal mode for binary integers
fr: Utilise le mode hexadécimal pour les entiers binaires

source: Define the number of bits in binary integers (1 to 64)
fr: Définis le nombre de bits des entiers binaires (de 1 à 64)

source: Get the number of bits in binary integers
fr: Renvoie le nombre de bits des entiers binaires

source: Convert a binary integer into a real
fr: Convertis un entier binaire en réel

source: Convert a real into a binary integer
fr: Convertis un réel en entier binaire

source: Save flag states in a binary integer
fr: Enregistre l'état des indicateurs binaires dans un entier binaire

source: Read flag states from a binary integer
fr: Récupère l'état des indicateurs binaires depuis un entier binaire

source: Wait a number of seconds
fr: Pause d'une durée définie en secondes

source: Halt program execution
fr: Suspends l'exécution du programme

source: Execute one step in the program
fr: Exécute une instruction dans le programme

source: Abort current program execution
fr: Arrête l'exécution du programme courant

source: Abort all programs execution
fr: Arrête l'exécution de tous les programmes

source: Resume program execution
fr: Reprends l'exécution du programme

source: Set reals display to 'standard'
fr: Règle l'affichage des réels à 'standard'

source: Set reals display to 'scientific'
fr: Règle l'affichage des réels à 'scientifique'

source: Set reals display to 'fixed number of decimals'
fr: Règle l'affichage des réels à 'nombre de décimales fixe'

source: Set reals display to 'engineering'
fr: Règle l'affichage des réels à 'ingénieur'

source: Clear the screen
fr: Efface l'écran

source: Clear the message flag => unfreeze stack display
fr: Désarme l'indicateur d'affichage => dégèle l'affichage de la pile

source: Display an item on a line of the screen
fr: Affiche une chaîne de caractères sur une ligne de l'écran

source: Read file and puts its content in the stack
fr: Lis le fichier et met son contenu dans la pile

source: Write the second item into the file named by the first item
fr: Écris le second élément de la pile dans le fichier nommé par le premier élément

source: Internal: tune real 'standard' display management
fr: Interne : règle la gestion de l'affichage des réels en mode 'standard'

source: Internal: set whether or not to keep a trailing dot in reals display
fr: Interne : détermine s'il faut afficher un point à la fin des réels

source: Undo last command, 50 levels by default
fr: Annule la dernière commande, 50 niveaux par défaut

source: Define number of undo levels
fr: Définis le nombre de niveaux d'annulation

source: Get number of undo levels
fr: Renvoie le nombre de niveaux d'annulations

source: Command (number of arguments): description
fr: Commande (nombre d'arguments) : description

source: Object type
fr: Type d'objet

source: Symbol
fr: Symbole

source: Example
fr: Exemple

source: Data
fr: Donnée

source: Real Number
fr: Nombre réel

source: Complex Number
fr: Nombre Complexe

source: Binary Integer
fr: Entier Binaire

source: String
fr: Chaîne de Caractères

source: "RESULT"
fr: "RÉSULTAT"

source: Vector
fr: Vecteur

source: Matrix
fr: Matrice

source: List
fr: Liste

source: Names
fr: Noms

source: Name
fr: Nom

source: Procedures
fr: Programmes

source: Program
fr: Programme

source: Algebraic
fr: Algébrique

source: Flag #
fr: Ind. #

source: Status
fr: État

source: Set
fr: Activé

source: Unset
fr: Désactivé
